{"Created By":"Creado Por",
 "Project Links":"Enlaces de proyectos",
 "Tools":"Útiles",
 "Question1":"¿Qué haces ahora? ¿Cómo empezaste con p5.js? ",
 "Question2":"¿Cómo usaste p5.js en este proyecto? ",
 "Question3":"¿Cuál es tu función favorita de p5.js? ",
 "Question4":"¿Enfrentó algún desafío al trabajar en este proyecto? Si es así, ¿cómo los superaste? ",
 "About":"What is p5.js showcase!",
 "showcase":[
    {
    "id": "airi-flies",
    "title": "Airi Flies",
    "image": "airi-flies.png",
    "description": "En este juego desarrollado con p5.play, ayuda a Airi volar diciendo PEW.",
    "location":"De Kiev, Ucrania",
    "author": "Phuong Ngo",
    "pronouns": "she/her",
    "type": "game",
    "resources":
    [ 
        {
        "name":"Juega Airi Flies!",
        "link": "https://www.yonaymoris.me/AiriFlies/"
        },
        { 
        "name":"Código para AiriFlies en Github",
        "link": "https://github.com/yonaymoris/AiriFlies"
        },
        {
        "name":"Más info en el portafolio de Phuong Ngo",
        "link": "https://www.yonaymoris.me/projects/airiflies"
    }
    ],
        
    "tools": "ml5.js,p5.play",
    
    "qanda": {
        "answer1":"Soy una programadora y diseñadora creativa, un receptor de la beca de diversidad [School of Machines, Making & Make-Believe diversity scholarship recipient](https://schoolofma.org/), y solo una criatura curiosa.\n\nEstaba tomando un curso en la Escuela de Máquinas en Berlín este verano llamado \"Bots and Machine Learning\", principalmente impartido por[Yining Shi](https://1023.io/).",
        "answer2":"I used p5.js to work on the visual part of the game. The animation sprites for Airi and the ghosts were drawn on an iPad app called [Pixaki](https://rizer.co/pixaki/) and then integrated into [p5.play](https://molleindustria.github.io/p5.play/) code. I mainly used examples at p5.play as a reference.\n\nFor the endless scrolling background, I found a p5 sketch by [chjno](https://editor.p5js.org/chjno/sketches/ByZlypKWM). I set a condition so whenever the word \"pew\" or a mouse click was detected, the scrolling speed would change to make an illusion of Airi flying up. When the user does not do anything, the scrolling speed is negative, which makes it look like Airi is falling down.\n\nFor sound recognition, I used [Google's Teachable Machine 2](https://teachablemachine.withgoogle.com/io19) (currently, there is a beta version not available in public yet, but it will be very soon!). I added around 120 samples of my classmates saying the word \"pew\" with different intonations and 80 samples of background noise to train it. Then I integrated the model into the game with [ml5.js](https://ml5js.org/).",
        "answer3":"I really love how easily you can create, manipulate, and delete HTML blocks and classes with the p5.js library via [createDiv()](https://p5js.org/reference/#/p5/createDiv), [addClass()](https://p5js.org/reference/#/p5.Element/addClass) etc. But my most favorite function is [draw()](https://p5js.org/reference/#/p5/draw), since this is where you create magic.",
        "answer4":"There were a lot of challenges simply because p5.js was something new to me. I did not work much with JavaScript in general before. Reading documentation and searching for similar examples helped a lot."
    }
    },
    {
        "id": "programmed-plotter",
        "title": "Programmed Plotter Drawings",
        "image": "programmed-plotter.png",
        "description": "Ondas senoidales y lerps generadas en p5.js, exportados como SVG y dibujados con un plotter y bolígrafos.",
        "location":"Toronto, Canada",
        "author": "Roni Cantor",  
        "pronouns": "she/her",
        "resources":
        [ 
            {
            "name":"link1",
            "link": "https://www.google.com/"
            },
            { 
            "name":"link1",
            "link": "https://www.google.com/"
            }
        ],
        
        "type": "game",
        
        "tools":"lerp()",
        
        "qanda": {
            "answer1":"I'm a creative coder and designer, a School of Machines, Making & Make-Believe diversity scholarship recipient, and just a curious creature.\n\nI was taking a course at the School of Machines in Berlin this summer called \"Bots and Machine Learning,\" mainly taught by Yining Shi.",
            "answer2":"I used p5.js to work on the visual part of the game. The animation sprites for Airi and the ghosts were drawn on an iPad app called Pixaki and then integrated into p5.play code. I mainly used examples at p5.play as a reference.\n\nFor the endless scrolling background, I found a p5 sketch by chjno. I set a condition so whenever the word \"pew\" or a mouse click was detected, the scrolling speed would change to make an illusion of Airi flying up. When the user does not do anything, the scrolling speed is negative, which makes it look like Airi is falling down.\n\nFor sound recognition, I used Google's Teachable Machine 2 (currently, there is a beta version not available in public yet, but it will be very soon!). I added around 120 samples of my classmates saying the word \"pew\" with different intonations and 80 samples of background noise to train it. Then I integrated the model into the game with ml5.js."
        }
        }
]
}