{"Created By":"Creado Por",
 "Project Links":"Enlaces de proyectos",
 "Tools":"Útiles",
 "Question1":"¿Qué haces ahora? ¿Cómo empezaste con p5.js? ",
 "Question2":"¿Cómo usaste p5.js en este proyecto? ",
 "Question3":"¿Cuál es tu función favorita de p5.js? ",
 "Question4":"¿Enfrentó algún desafío al trabajar en este proyecto? Si es así, ¿cómo los superaste? ",
 "Question5":"¿Qué es algo cool que deberíamos explorar?",
 "About":"What is p5.js showcase?",
 "AboutIntro":"Presentamos Showcase, creada por [Ashley Kang](https://ashleykang.dev) en 2019 y actualmente curada por [Connie Liu](https://connieliu0.github.io). Estamos celebrando cómo las personas usan p5.js para hacer que trabajos creativos, el aprendizaje y fuente abierta sean más interesantes e inclusivos. Juntos, hacemos una comunidad. Durante el verano de 2020, le pedimos a creadores que compartieran cómo usan p5.js en variados proyectos y piezas. Durante el verano 2020, Showcase está abierto a postulaciones, ¡nomina el trabajo con p5.js de alguien o el tuyo para ser incluid aquí!",
 "Welcome":"¡Bienvenido a p5.js 2020 Showcase!",
 "showcase":[
    {
    "id": "airi-flies",
    "title": "Airi Flies",
    "image": "airi-flies.png",
    "description": "En este juego desarrollado con p5.play, ayuda a Airi volar diciendo PEW.",
    "location":"De Kiev, Ucrania",
    "author": "Phuong Ngo",
    "pronouns": "ella",
    "type": "game",
    "resources":
    [ 
        {
        "name":"Juega Airi Flies!",
        "link": "https://www.yonaymoris.me/AiriFlies/"
        },
        { 
        "name":"Código para AiriFlies en Github",
        "link": "https://github.com/yonaymoris/AiriFlies"
        },
        {
        "name":"Más info en el portafolio de Phuong Ngo",
        "link": "https://www.yonaymoris.me/projects/airiflies"
    }
    ],
        
    "tools": "ml5.js,p5.play",
    "socials":[{
        "name":"sitio Web",
        "link": "https://www.yonaymoris.me/"
        }
    ],
    "qanda": {
        "answer1":"Soy una programadora y diseñadora creativa, un receptor de la beca de diversidad [School of Machines, Making & Make-Believe diversity scholarship recipient](https://schoolofma.org/), y solo una criatura curiosa.\n\nEstaba tomando un curso en la Escuela de Máquinas en Berlín este verano llamado \"Bots and Machine Learning\", principalmente impartido por[Yining Shi](https://1023.io/).",
        "answer2":"Usé p5.js para trabajar en la parte visual del juego. Los sprites de animación para Airi y los fantasmas se dibujaron en una aplicación para iPad llamada [Pixaki](https://rizer.co/pixaki/) y luego se integraron en el código [p5.play](https://molleindustria.github.io/p5.play/). Principalmente utilicé ejemplos en p5.play como referencia.\n\nPara el fondo de desplazamiento sin fin, encontré un [chjno](https://editor.p5js.org/chjno/sketches/ByZlypKWM). Establecí una condición para que cada vez que se detectara la palabra \"pew\" o un clic del mouse, la velocidad de desplazamiento cambiara para crear una ilusión de Airi volando hacia arriba. Cuando el usuario no hace nada, la velocidad de desplazamiento es negativa, hace que parezca que Airi se está cayendo.\n\n Para el reconocimiento de sonido, utilicé [Google's Teachable Machine 2](https://teachablemachine.withgoogle.com/io19) (actualmente, hay una versión beta que aún no está disponible en público, ¡pero lo estará muy pronto!). Agregué alrededor de 120 muestras de mis compañeros de clase diciendo la palabra \"pew\" con diferentes entonaciones y 80 muestras de ruido de fondo para entrenarlo. Luego integré el modelo en el juego con [ml5.js](https://ml5js.org/).",
        "answer3":"Realmente me encanta lo fácil que se puede crear, manipular y eliminar bloques y clases HTML con la p5.js library a través de [createDiv()](https://p5js.org/reference/#/p5/createDiv), [addClass()](https://p5js.org/reference/#/p5.Element/addClass) etc. Pero mi función favorita es.",
        "answer4":"Hubieron muchos desafíos simplemente porque p5.js era algo nuevo para mí. No había trabajado mucho con JavaScript en general antes. Leer documentación y buscar ejemplos similares ayudó mucho.",
        "answer5":"[@gandyworks](https://www.instagram.com/gandyworks/) en Instagram: cosas de plotter análogo súper geniales.."
    }
    },
    {
        "id": "programmed-plotter",
        "title": "Programmed Plotter Drawings",
        "image": "programmed-plotter.png",
        "description": "Ondas senoidales y lerps generadas en p5.js, exportados como SVG y dibujados con un plotter y bolígrafos.",
        "location":"De Toronto, Canadá",
        "author": "Roni Cantor",  
        "pronouns": "she/her",
        "resources":
        [ 
            {
                "name":"Sketch de ejemplo en p5.js Web Editor",
                "link": "https://editor.p5js.org/ronicantor/sketches/eq2bIhmh2"
                },
                { 
                "name":"AxiDraw V3 demo video",
                "link": "https://drive.google.com/file/d/1UJy6q5cDl6Hg79O9mX1ZN7NFp0NXSYCs/view?usp=sharing"
                }
        ],
        
        "type": "game",
        
        "tools":"lerp()",

        "socials":[{
            "name":"",
            "link":""
        }
        ],
        "qanda": {
            "answer1":"Me acabo de graduar del programa de Nuevos Medios (New Media) de la Universidad de Ryerson. Después de 4 años de programación y fabricación de robots, decidí tomar un descanso y jugar con algunas formas de arte más tradicionales, mientras que todavía programando y jugando con robots. ¡Comencé a usar p5.js en [NYU ITP Camp](https://itp.nyu.edu/camp2019/)! \n\nDespués de usar Processing durante muchos años, quería probar algo nuevo.",
            "answer2":"Utilicé p5.js en este proyecto para generar las fórmulas de onda sinusoidal y lerp (interpolación lineal) y mostrar las imágenes en el [p5.js Web Editor](https://editor.p5js.org/). Luego usé una función en mi código que exportaba mi gráfico programado a un archivo [SVG](https://developer.mozilla.org/en-US/docs/Web/SVG). Necesitaba un archivo SVG para darle al plotter, un [AxiDraw V3](https://shop.evilmadscientist.com/productsmenu/846), para que entendiera dónde dibujar las líneas que programé. ¡Envié esta información al trazador con un programa llamado [Inkscape](https://inkscape.org/)",
            "answer3":"[lerp()](https://p5js.org/reference/#/p5/lerp) porque las líneas son divertidas y \"lerp\" es una palabra divertida para decir!",
            "answer4":"¡Era la primera vez que usaba p5.js, Inkscape y un plotter! Realmente me beneficié de las personas a mi alrededor que habían usado p5 antes, así como de guías y foros en línea.",
            "answer5":"[@gandyworks](https://www.instagram.com/gandyworks/) en Instagram: cosas de plotter análogo súper geniales.."
        }
        },
        {
            "id": "chillin",
            "title": "Chillin'",
            "image": "chillin.png",
            "description": "Un póster tipográfico interactivo que utiliza el sensor de movimiento de un dispositivo móvil con p5.js.",
            "location":"Baltimore, Maryland",
            "author": "Dae In Chung",  
            "pronouns": "el",
            "resources":
            [ 
                {
                "name":"Vean Chillin’",
                "link": "https://exp.paperdove.com/chillin/"
                },
         {
                "name":"Código para Chillin’ en GitHub",
                "link": "https://github.com/cdaein/exp/tree/gh-pages/chillin"
                },
         {
                "name":"Más info en el portafolio de Dae In Chung",
                "link": "https://paperdove.com/work/2019-chillin/"
                }
            ],
            
            "type": "visual",
            
            "tools":"matter.js,p5 WebGL,p5.camera",
    
            "socials":[{
                "name":"Instagram",
                "link":"https://www.instagram.com/cdaein/"
            }
            ],
            "qanda": {
                "answer1":"Soy diseñador gráfico y miembro de la facultad en Maryland Institute College of Art, donde enseño principalmente programación (con p5.js y Processing, por supuesto) y motion graphics.\n\n He estado usando Processing durante algún tiempo, y cuando apareció p5.js, comencé a usarlo sin pensarlo dos veces porque era fácil convertir el código de Processing existente y compartir proyectos en línea.",
                "answer2":"Este verano, me di el desafío de hacer carteles tipográficos con programación, y este es uno de los carteles que hice. Hasta hace muy poco, no sabía que podía usar los datos del sensor de movimiento con p5.js. También estaba viendo los [video tutoriales de Dan Shiffman matter.js](https://www.youtube.com/playlist?list=PLRqwX-V7Uu6bLh3T_4wtrmVHOrOEM1ig_), así que pensé ¿por qué no combinar los dos y practicar lo que estaba aprendiendo?",
                "answer3":"THay muchas cosas que me encantan de p5.js, como la comunidad en línea y la amabilidad de los principiantes. Lo que realmente me gusta en este momento es el [online editor](https://editor.p5js.org/), con el que no solo puedo trabajar en línea para mí, sino también compartir el URL rápidamente en el modo actual. Para este proyecto en particular, tuve que hacer muchas pruebas en mi teléfono, y fue mucho más fácil y rápido que comprometerme con GitHub.",
                "answer4":"Tuve algunos problemas con el manejo de la fuente, el canal alfa y z-depth en el modo [WebGL](https://github.com/processing/p5.js/wiki/Getting-started-with-WebGL-in-p5). Todavía no estoy contento con todas mis decisiones. Pero en general, fue útil buscar en el foro y no olvidar dividir los problemas en otros más pequeños e iterar poco a poco. Además, tuve problemas para renderizar archivos de video directamente desde p5.js. La grabación de pantalla no era una opción debido a caídas de frecuencia de cuadros intermitentes (mi computadora portátil es bastante lenta). Después de investigar un poco, decidí aprender algunos conceptos básicos de [Electron](https://electronjs.org/) crear una herramienta para mí.",
                "answer5":"Como se mencionó anteriormente, si desea renderizar cuadros y archivos de video a partir de bocetos de p5.js, consulte mi [Canvas Saver boilerplate](https://github.com/cdaein/p5js-electron-canvas-saver-boilerplate) y hazme saber lo que piensas."
            }
            }
    
]
}